#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
random_pet.secret_name: Refreshing state... [id=strangely-steady-monkfish]
random_password.master: Refreshing state... [id=none]
module.email_request_processor.module.lambda_function_container_image.data.aws_partition.current: Reading...
module.ingestion.module.lambda_function_container_image.data.aws_caller_identity.current: Reading...
module.email_response_processor.module.lambda_function_container_image.data.aws_caller_identity.current: Reading...
module.lex_router.module.lambda_function_container_image.data.aws_iam_policy_document.additional_inline[0]: Reading...
module.lex_router.module.lambda_function_container_image.data.aws_partition.current: Reading...
module.ingestion.aws_s3_bucket.ingestion_source_storage: Refreshing state... [id=levio-demo-fev-storage-dev]
module.email_request_processor.module.fifo_sqs.aws_sqs_queue.this[0]: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/446872271111/levio-demo-fev-email-request-processor-queue-dev.fifo]
module.email_request_processor.module.lambda_function_container_image.data.aws_iam_policy_document.assume_role[0]: Reading...
module.email_request_processor.module.lambda_function_container_image.data.aws_partition.current: Read complete after 0s [id=aws]
module.lex_router.module.lambda_function_container_image.data.aws_iam_policy_document.additional_inline[0]: Read complete after 0s [id=1348983281]
module.lex_router.module.lambda_function_container_image.data.aws_partition.current: Read complete after 0s [id=aws]
module.email_response_processor.module.lambda_function_container_image.data.aws_caller_identity.current: Read complete after 0s [id=446872271111]
module.memory.module.lambda_function_container_image.data.aws_region.current: Reading...
module.email_request_processor.module.lambda_function_container_image.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.memory.module.lambda_function_container_image.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.list_collections.data.aws_ecr_image.lambda_image: Reading...
module.email_response_processor.module.lambda_function_container_image.data.aws_iam_policy_document.assume_role[0]: Reading...
module.inference.module.lambda_function_container_image.data.aws_caller_identity.current: Reading...
module.ingestion.module.lambda_function_container_image.data.aws_caller_identity.current: Read complete after 0s [id=446872271111]
module.email_response_processor.module.lambda_function_container_image.data.aws_partition.current: Reading...
module.email_response_processor.module.lambda_function_container_image.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.email_response_processor.module.lambda_function_container_image.data.aws_region.current: Reading...
module.inference.data.aws_ecr_image.lambda_image: Reading...
module.email_response_processor.module.lambda_function_container_image.data.aws_partition.current: Read complete after 0s [id=aws]
module.email_response_processor.module.lambda_function_container_image.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.inference.module.lambda_function_container_image.data.aws_caller_identity.current: Read complete after 0s [id=446872271111]
module.inference.module.lambda_function_container_image.data.aws_region.current: Reading...
module.email_response_processor.data.aws_caller_identity.current: Reading...
module.inference.module.lambda_function_container_image.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.memory.module.lambda_function_container_image.data.aws_iam_policy_document.additional_inline[0]: Reading...
module.list_collections.module.lambda_function_container_image.data.aws_partition.current: Reading...
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-00fb300ee2d2f7b3b]
module.email_response_processor.data.aws_caller_identity.current: Read complete after 0s [id=446872271111]
module.list_collections.module.lambda_function_container_image.data.aws_partition.current: Read complete after 0s [id=aws]
module.email_response_processor.module.lambda_function_container_image.aws_cloudwatch_log_group.lambda[0]: Refreshing state... [id=/aws/lambda/levio-demo-fev-email-response-processor-dev]
module.lex_router.module.lambda_function_container_image.data.aws_region.current: Reading...
data.aws_availability_zones.available: Reading...
module.lex_router.module.lambda_function_container_image.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.memory.module.lambda_function_container_image.aws_cloudwatch_log_group.lambda[0]: Refreshing state... [id=/aws/lambda/levio-demo-fev-memory-dev]
module.memory.module.lambda_function_container_image.data.aws_iam_policy_document.additional_inline[0]: Read complete after 0s [id=3277652423]
module.memory.aws_dynamodb_table.basic-conversation_memory_table-table: Refreshing state... [id=levio-demo-fev-chat-history-dev]
module.list_collections.module.lambda_function_container_image.data.aws_iam_policy_document.assume_role[0]: Reading...
module.list_collections.module.lambda_function_container_image.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.email_request_processor.module.lambda_function_container_image.data.aws_caller_identity.current: Reading...
module.email_request_processor.module.lambda_function_container_image.data.aws_caller_identity.current: Read complete after 0s [id=446872271111]
module.memory.data.aws_ecr_image.lambda_image: Reading...
data.aws_ami.latest_amazon_linux: Reading...
module.list_collections.module.integration_base.data.aws_caller_identity.current: Reading...
data.aws_availability_zones.available: Read complete after 0s [id=us-east-1]
module.list_collections.module.integration_base.data.aws_caller_identity.current: Read complete after 0s [id=446872271111]
module.lex_router.module.lambda_function_container_image.data.aws_iam_policy_document.assume_role[0]: Reading...
aws_iam_role.this: Refreshing state... [id=levio-demo-fev-api-role]
module.lex_router.module.lambda_function_container_image.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.list_collections.module.lambda_function_container_image.data.aws_caller_identity.current: Reading...
aws_api_gateway_rest_api.this: Refreshing state... [id=d09uj3e9kh]
module.list_collections.module.lambda_function_container_image.data.aws_caller_identity.current: Read complete after 0s [id=446872271111]
module.ingestion.module.lambda_function_container_image.data.aws_region.current: Reading...
module.ingestion.module.lambda_function_container_image.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.lex_router.module.lambda_function_container_image.aws_cloudwatch_log_group.lambda[0]: Refreshing state... [id=/aws/lambda/levio-demo-fev-lex-router-dev]
module.ingestion.data.aws_ecr_image.lambda_image: Reading...
module.list_collections.data.aws_ecr_image.lambda_image: Read complete after 0s [id=sha256:56821913263de4968d117c5131e20b93fab78e67c1338c7d7a8c59a5f0692228]
module.inference.data.aws_ecr_image.lambda_image: Read complete after 0s [id=sha256:99b69b4d9abc9aae05ee5bbcff2ac721bc77fd808e4ffb3a00dc0559d61f9b2d]
module.memory.module.lambda_function_container_image.data.aws_iam_policy_document.assume_role[0]: Reading...
module.inference.module.integration_base.data.aws_caller_identity.current: Reading...
module.memory.module.lambda_function_container_image.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.ingestion.module.lambda_function_container_image.data.aws_partition.current: Reading...
module.ingestion.module.lambda_function_container_image.data.aws_partition.current: Read complete after 0s [id=aws]
module.email_response_processor.data.aws_ecr_image.lambda_image: Reading...
module.inference.module.integration_base.data.aws_caller_identity.current: Read complete after 0s [id=446872271111]
module.memory.module.lambda_function_container_image.data.aws_caller_identity.current: Reading...
module.list_collections.module.lambda_function_container_image.aws_cloudwatch_log_group.lambda[0]: Refreshing state... [id=/aws/lambda/levio-demo-fev-list-collections-dev]
module.memory.module.lambda_function_container_image.data.aws_caller_identity.current: Read complete after 0s [id=446872271111]
aws_db_parameter_group.default: Refreshing state... [id=rds-pg]
module.memory.data.aws_ecr_image.lambda_image: Read complete after 0s [id=sha256:4bbc2f4abb25a4eb21c43b8dc232db428c1fe9419cf3cd31dd07bf448dc7780e]
module.email_request_processor.module.lambda_function_container_image.aws_iam_role.lambda[0]: Refreshing state... [id=levio-demo-fev-email-request-processor-dev-role]
module.lex_router.module.lambda_function_container_image.aws_iam_policy.additional_inline[0]: Refreshing state... [id=arn:aws:iam::446872271111:policy/levio-demo-fev-lex-router-dev-role-inline]
module.ingestion.data.aws_ecr_image.lambda_image: Read complete after 0s [id=sha256:4c8ce856252bf181a047cc1ccfb61d3f625b7dc95b33399343d83886b7b4bd48]
aws_api_gateway_api_key.this: Refreshing state... [id=mwfvag0h0f]
module.list_collections.module.lambda_function_container_image.data.aws_region.current: Reading...
module.list_collections.module.lambda_function_container_image.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.email_response_processor.module.fifo_sqs.aws_sqs_queue.this[0]: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/446872271111/levio-demo-fev-email-response-processor-queue-dev.fifo]
module.email_request_processor.module.lambda_function_container_image.aws_cloudwatch_log_group.lambda[0]: Refreshing state... [id=/aws/lambda/levio-demo-fev-email-request-processor-dev]
module.email_response_processor.data.aws_ecr_image.lambda_image: Read complete after 0s [id=sha256:968390020a59764b47878f01137fed22704c90170347abb9e1c6009fff76ef35]
module.inference.module.lambda_function_container_image.data.aws_iam_policy_document.assume_role[0]: Reading...
module.ingestion.module.lambda_function_container_image.aws_cloudwatch_log_group.lambda[0]: Refreshing state... [id=/aws/lambda/levio-demo-fev-ingestion-dev]
module.inference.module.lambda_function_container_image.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.inference.module.lambda_function_container_image.data.aws_partition.current: Reading...
module.inference.module.lambda_function_container_image.data.aws_partition.current: Read complete after 0s [id=aws]
module.email_request_processor.data.aws_ecr_image.lambda_image: Reading...
aws_secretsmanager_secret.password: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:446872271111:secret:vectordb-password-main-strangely-steady-monkfish-dKgTZD]
module.lex_router.data.aws_ecr_image.lambda_image: Reading...
module.email_request_processor.module.lambda_function_container_image.data.aws_region.current: Reading...
module.email_request_processor.module.lambda_function_container_image.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.inference.module.integration_cognito.data.aws_caller_identity.current: Reading...
module.ingestion.module.lambda_function_container_image.data.aws_iam_policy_document.assume_role[0]: Reading...
module.ingestion.module.lambda_function_container_image.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.lex_router.module.lambda_function_container_image.data.aws_caller_identity.current: Reading...
module.inference.module.integration_cognito.data.aws_caller_identity.current: Read complete after 0s [id=446872271111]
data.aws_cognito_user_pools.api_cognito: Reading...
module.lex_router.module.lambda_function_container_image.data.aws_caller_identity.current: Read complete after 0s [id=446872271111]
module.ingestion.aws_sqs_queue.dead_letter_queue: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/446872271111/levio-demo-fev-ingestion-queue-dev_dead_letter]
module.inference.module.lambda_function_container_image.aws_cloudwatch_log_group.lambda[0]: Refreshing state... [id=/aws/lambda/levio-demo-fev-inference-dev]
module.memory.module.lambda_function_container_image.data.aws_partition.current: Reading...
module.memory.module.lambda_function_container_image.data.aws_partition.current: Read complete after 0s [id=aws]
module.email_response_processor.module.lambda_function_container_image.aws_iam_role.lambda[0]: Refreshing state... [id=levio-demo-fev-email-response-processor-dev-role]
data.aws_ami.latest_amazon_linux: Read complete after 0s [id=ami-014d544cfef21b42d]
module.memory.module.lambda_function_container_image.aws_iam_policy.additional_inline[0]: Refreshing state... [id=arn:aws:iam::446872271111:policy/levio-demo-fev-memory-dev-role-inline]
module.list_collections.module.lambda_function_container_image.aws_iam_role.lambda[0]: Refreshing state... [id=levio-demo-fev-list-collections-dev-role]
module.lex_router.module.lambda_function_container_image.aws_iam_role.lambda[0]: Refreshing state... [id=levio-demo-fev-lex-router-dev-role]
data.aws_cognito_user_pools.api_cognito: Read complete after 0s [id=estaec814cb7e6_userpool_814cb7e6-dev]
module.memory.module.lambda_function_container_image.aws_iam_role.lambda[0]: Refreshing state... [id=levio-demo-fev-memory-dev-role]
module.lex_router.data.aws_ecr_image.lambda_image: Read complete after 0s [id=sha256:d9d57533a2d12d937816582c71ca24ad0365d96414d5a06f5c8e8c9ee239346a]
aws_iam_role_policy.this: Refreshing state... [id=levio-demo-fev-api-role:this]
module.inference.module.lambda_function_container_image.aws_iam_role.lambda[0]: Refreshing state... [id=levio-demo-fev-inference-dev-role]
module.email_request_processor.data.aws_ecr_image.lambda_image: Read complete after 0s [id=sha256:72c79ebd107003d13330305834c99af64c9c0c1c9f6cfc009942eccca414eeb3]
aws_api_gateway_account.this: Refreshing state... [id=api-gateway-account]
module.ingestion.module.lambda_function_container_image.aws_iam_role.lambda[0]: Refreshing state... [id=levio-demo-fev-ingestion-dev-role]
module.ingestion.aws_sqs_queue.queue: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/446872271111/levio-demo-fev-ingestion-queue-dev]
aws_api_gateway_authorizer.this: Refreshing state... [id=p9hrwu]
data.aws_secretsmanager_secret.password: Reading...
aws_secretsmanager_secret_version.password: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:446872271111:secret:vectordb-password-main-strangely-steady-monkfish-dKgTZD|terraform-20240126151709956800000002]
module.memory.module.lambda_function_container_image.data.aws_iam_policy_document.logs[0]: Reading...
module.memory.module.lambda_function_container_image.data.aws_iam_policy_document.logs[0]: Read complete after 0s [id=3522429600]
module.ingestion.data.aws_iam_policy_document.sqs_policy: Reading...
module.email_response_processor.module.lambda_function_container_image.data.aws_iam_policy_document.logs[0]: Reading...
module.email_response_processor.module.lambda_function_container_image.data.aws_iam_policy_document.logs[0]: Read complete after 0s [id=3325663242]
module.ingestion.data.aws_iam_policy_document.sqs_policy: Read complete after 0s [id=1366123725]
module.list_collections.module.lambda_function_container_image.data.aws_iam_policy_document.logs[0]: Reading...
module.lex_router.module.lambda_function_container_image.data.aws_iam_policy_document.logs[0]: Reading...
module.email_response_processor.module.lambda_function_container_image.data.aws_iam_policy_document.additional_inline[0]: Reading...
module.list_collections.module.lambda_function_container_image.data.aws_iam_policy_document.logs[0]: Read complete after 0s [id=736838273]
module.lex_router.module.lambda_function_container_image.data.aws_iam_policy_document.logs[0]: Read complete after 0s [id=3953744684]
module.list_collections.module.integration_base.aws_api_gateway_resource.api_gateway_resource: Refreshing state... [id=4z02sq]
module.email_response_processor.module.lambda_function_container_image.data.aws_iam_policy_document.additional_inline[0]: Read complete after 0s [id=2463471094]
module.inference.module.integration_cognito.aws_api_gateway_resource.api_gateway_resource: Refreshing state... [id=uvd5hn]
module.inference.module.integration_base.aws_api_gateway_resource.api_gateway_resource: Refreshing state... [id=nw7wpk]
module.ingestion.module.lambda_function_container_image.data.aws_iam_policy_document.logs[0]: Reading...
module.ingestion.module.lambda_function_container_image.data.aws_iam_policy_document.logs[0]: Read complete after 0s [id=52771042]
module.email_request_processor.module.lambda_function_container_image.data.aws_iam_policy_document.logs[0]: Reading...
module.email_request_processor.module.lambda_function_container_image.data.aws_iam_policy_document.logs[0]: Read complete after 0s [id=2314128230]
module.inference.module.lambda_function_container_image.data.aws_iam_policy_document.logs[0]: Reading...
module.inference.module.lambda_function_container_image.data.aws_iam_policy_document.logs[0]: Read complete after 0s [id=2926739739]
module.memory.module.lambda_function_container_image.aws_iam_policy.logs[0]: Refreshing state... [id=arn:aws:iam::446872271111:policy/levio-demo-fev-memory-dev-role-logs]
module.memory.module.lambda_function_container_image.aws_iam_role_policy_attachment.additional_inline[0]: Refreshing state... [id=levio-demo-fev-memory-dev-role-20240126151710029800000004]
data.aws_secretsmanager_secret.password: Read complete after 0s [id=arn:aws:secretsmanager:us-east-1:446872271111:secret:vectordb-password-main-strangely-steady-monkfish-dKgTZD]
module.ingestion.aws_sqs_queue_policy.sqs_policy: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/446872271111/levio-demo-fev-ingestion-queue-dev]
module.email_response_processor.module.lambda_function_container_image.aws_iam_policy.logs[0]: Refreshing state... [id=arn:aws:iam::446872271111:policy/levio-demo-fev-email-response-processor-dev-role-logs]
module.list_collections.module.lambda_function_container_image.aws_iam_policy.logs[0]: Refreshing state... [id=arn:aws:iam::446872271111:policy/levio-demo-fev-list-collections-dev-role-logs]
module.lex_router.module.lambda_function_container_image.aws_iam_policy.logs[0]: Refreshing state... [id=arn:aws:iam::446872271111:policy/levio-demo-fev-lex-router-dev-role-logs]
module.email_response_processor.module.lambda_function_container_image.aws_iam_policy.additional_inline[0]: Refreshing state... [id=arn:aws:iam::446872271111:policy/levio-demo-fev-email-response-processor-dev-role-inline]
module.lex_router.module.lambda_function_container_image.aws_iam_role_policy_attachment.additional_inline[0]: Refreshing state... [id=levio-demo-fev-lex-router-dev-role-20240202183512646400000001]
module.ingestion.module.lambda_function_container_image.aws_iam_policy.logs[0]: Refreshing state... [id=arn:aws:iam::446872271111:policy/levio-demo-fev-ingestion-dev-role-logs]
module.email_request_processor.module.lambda_function_container_image.aws_iam_policy.logs[0]: Refreshing state... [id=arn:aws:iam::446872271111:policy/levio-demo-fev-email-request-processor-dev-role-logs]
module.inference.module.lambda_function_container_image.aws_iam_policy.logs[0]: Refreshing state... [id=arn:aws:iam::446872271111:policy/levio-demo-fev-inference-dev-role-logs]
data.aws_secretsmanager_secret_version.password: Reading...
module.email_request_processor.module.lambda_function_container_image.data.aws_iam_policy_document.additional_inline[0]: Reading...
module.email_request_processor.module.lambda_function_container_image.data.aws_iam_policy_document.additional_inline[0]: Read complete after 0s [id=2734712511]
module.list_collections.module.integration_base.aws_api_gateway_method.api_gateway_method: Refreshing state... [id=agm-d09uj3e9kh-4z02sq-GET]
module.inference.module.integration_base.aws_api_gateway_method.api_gateway_method: Refreshing state... [id=agm-d09uj3e9kh-nw7wpk-GET]
module.memory.module.lambda_function_container_image.aws_iam_role_policy_attachment.logs[0]: Refreshing state... [id=levio-demo-fev-memory-dev-role-20240126151710095500000006]
data.aws_secretsmanager_secret_version.password: Read complete after 0s [id=arn:aws:secretsmanager:us-east-1:446872271111:secret:vectordb-password-main-strangely-steady-monkfish-dKgTZD|AWSCURRENT]
module.email_request_processor.module.lambda_function_container_image.aws_iam_policy.additional_inline[0]: Refreshing state... [id=arn:aws:iam::446872271111:policy/levio-demo-fev-email-request-processor-dev-role-inline]
module.list_collections.module.integration_base.module.cors.aws_api_gateway_method._: Refreshing state... [id=agm-d09uj3e9kh-4z02sq-OPTIONS]
module.email_response_processor.module.lambda_function_container_image.aws_iam_role_policy_attachment.logs[0]: Refreshing state... [id=levio-demo-fev-email-response-processor-dev-role-20240221194307124300000002]
module.inference.module.integration_cognito.module.cors.aws_api_gateway_method._: Refreshing state... [id=agm-d09uj3e9kh-uvd5hn-OPTIONS]
module.inference.module.integration_base.module.cors.aws_api_gateway_method._: Refreshing state... [id=agm-d09uj3e9kh-nw7wpk-OPTIONS]
module.list_collections.module.lambda_function_container_image.aws_iam_role_policy_attachment.logs[0]: Refreshing state... [id=levio-demo-fev-list-collections-dev-role-20240130201651725000000001]
module.lex_router.module.lambda_function_container_image.aws_iam_role_policy_attachment.logs[0]: Refreshing state... [id=levio-demo-fev-lex-router-dev-role-20240202183512785600000002]
module.email_response_processor.module.lambda_function_container_image.aws_iam_role_policy_attachment.additional_inline[0]: Refreshing state... [id=levio-demo-fev-email-response-processor-dev-role-20240221194332717000000003]
module.email_request_processor.module.lambda_function_container_image.aws_iam_role_policy_attachment.logs[0]: Refreshing state... [id=levio-demo-fev-email-request-processor-dev-role-20240221194307033600000001]
module.inference.module.integration_base.aws_lambda_permission.lambda_permission: Refreshing state... [id=AllowExecutionFromAPIGateway-levio-demo-fev-inference-dev]
module.list_collections.module.integration_base.aws_lambda_permission.lambda_permission: Refreshing state... [id=AllowExecutionFromAPIGateway-levio-demo-fev-list-collections-dev]
module.inference.module.lambda_function_container_image.aws_iam_role_policy_attachment.logs[0]: Refreshing state... [id=levio-demo-fev-inference-dev-role-20240126151710029200000003]
module.ingestion.module.lambda_function_container_image.aws_iam_role_policy_attachment.logs[0]: Refreshing state... [id=levio-demo-fev-ingestion-dev-role-20240126151710031000000005]
module.list_collections.module.integration_base.module.cors.aws_api_gateway_integration._: Refreshing state... [id=agi-d09uj3e9kh-4z02sq-OPTIONS]
module.email_response_processor.module.lambda_function_container_image.aws_lambda_function.this[0]: Refreshing state... [id=levio-demo-fev-email-response-processor-dev]
module.list_collections.module.integration_base.module.cors.aws_api_gateway_method_response._: Refreshing state... [id=agmr-d09uj3e9kh-4z02sq-OPTIONS-200]
module.inference.module.integration_cognito.module.cors.aws_api_gateway_method_response._: Refreshing state... [id=agmr-d09uj3e9kh-uvd5hn-OPTIONS-200]
module.inference.module.integration_cognito.module.cors.aws_api_gateway_integration._: Refreshing state... [id=agi-d09uj3e9kh-uvd5hn-OPTIONS]
module.email_request_processor.module.lambda_function_container_image.aws_iam_role_policy_attachment.additional_inline[0]: Refreshing state... [id=levio-demo-fev-email-request-processor-dev-role-20240221194332764500000004]
module.inference.module.integration_base.module.cors.aws_api_gateway_method_response._: Refreshing state... [id=agmr-d09uj3e9kh-nw7wpk-OPTIONS-200]
module.inference.module.integration_base.module.cors.aws_api_gateway_integration._: Refreshing state... [id=agi-d09uj3e9kh-nw7wpk-OPTIONS]
module.list_collections.module.integration_base.module.cors.aws_api_gateway_integration_response._: Refreshing state... [id=agir-d09uj3e9kh-4z02sq-OPTIONS-200]
module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-0b9066ddfe118437e]
module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-086b3e733d88fa370]
aws_security_group.lambda_egress_all_sg: Refreshing state... [id=sg-054f9a76901acf353]
aws_security_group.sm_sg: Refreshing state... [id=sg-013ee0bdd16b8366f]
aws_security_group.bedrock_sg: Refreshing state... [id=sg-0902cb6d437a968b6]
aws_security_group.jumpbox_sg: Refreshing state... [id=sg-0b9900b5db426c576]
module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-0d7ddd92ffe7cad50]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-02f9981846a152b24]
module.vpc.aws_route_table.database[1]: Refreshing state... [id=rtb-00ef44a2d775aaa99]
module.vpc.aws_route_table.database[0]: Refreshing state... [id=rtb-0f03a46a772c6a571]
module.vpc.aws_subnet.database[1]: Refreshing state... [id=subnet-0d1f5f95132e695a6]
module.vpc.aws_subnet.database[0]: Refreshing state... [id=subnet-03f5acb4bc8b5d586]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-04aae6346ab85dfe5]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0bbe5e0845bba1093]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-09be498e3f465bbb5]
module.inference.module.integration_base.module.cors.aws_api_gateway_integration_response._: Refreshing state... [id=agir-d09uj3e9kh-nw7wpk-OPTIONS-200]
module.email_response_processor.module.lambda_function_container_image.aws_lambda_event_source_mapping.this["sqs"]: Refreshing state... [id=6372d997-1ffe-4d2e-b58c-8870ba706c3d]
module.email_response_processor.module.lambda_function_container_image.aws_lambda_permission.unqualified_alias_triggers["sqs"]: Refreshing state... [id=sqs]
aws_security_group.dynamo_db_sg: Refreshing state... [id=sg-0c6d3637458aa4799]
aws_security_group.database_sg: Refreshing state... [id=sg-02511ace313a817bd]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-02f9981846a152b241080289494]
aws_vpc_endpoint.s3_endpoint: Refreshing state... [id=vpce-0fdf03f021658d47f]
aws_vpc_endpoint.dynamo_db_endpoint: Refreshing state... [id=vpce-04b83095daf470dae]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0db0a8005c04ca4f2]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-066d9aa6005ec7c94]
aws_vpc_endpoint.bedrock_endpoint: Refreshing state... [id=vpce-0a8ed6effde8d7daf]
aws_instance.jumpbox: Refreshing state... [id=i-002f0096e010e7064]
aws_vpc_endpoint.lambda_endpoint: Refreshing state... [id=vpce-0b1660c4cfd3c329e]
aws_vpc_endpoint.secrets_manager_endpoint: Refreshing state... [id=vpce-07b8182fd57a40bc7]
module.vpc.aws_route_table_association.database[0]: Refreshing state... [id=rtbassoc-044bfd1713e1c30ec]
module.vpc.aws_route_table_association.database[1]: Refreshing state... [id=rtbassoc-0d7135c7f623e06f8]
module.vpc.aws_db_subnet_group.database[0]: Refreshing state... [id=ex-terraform-dev]
module.memory.module.lambda_function_container_image.aws_lambda_function.this[0]: Refreshing state... [id=levio-demo-fev-memory-dev]
module.lex_router.module.lambda_function_container_image.aws_lambda_function.this[0]: Refreshing state... [id=levio-demo-fev-lex-router-dev]
module.inference.module.integration_cognito.module.cors.aws_api_gateway_integration_response._: Refreshing state... [id=agir-d09uj3e9kh-uvd5hn-OPTIONS-200]
aws_db_instance.vector_db: Refreshing state... [id=db-KTG3TDKXH3C3BOXFTTIFJ5SASY]
module.list_collections.module.lambda_function_container_image.data.aws_iam_policy_document.additional_inline[0]: Reading...
module.inference.module.lambda_function_container_image.data.aws_iam_policy_document.additional_inline[0]: Reading...
module.list_collections.module.lambda_function_container_image.data.aws_iam_policy_document.additional_inline[0]: Read complete after 0s [id=1333636943]
module.ingestion.module.lambda_function_container_image.data.aws_iam_policy_document.additional_inline[0]: Reading...
module.list_collections.module.lambda_function_container_image.aws_iam_policy.additional_inline[0]: Refreshing state... [id=arn:aws:iam::446872271111:policy/levio-demo-fev-list-collections-dev-role-inline]
module.inference.module.lambda_function_container_image.data.aws_iam_policy_document.additional_inline[0]: Read complete after 0s [id=242001761]
module.ingestion.module.lambda_function_container_image.data.aws_iam_policy_document.additional_inline[0]: Read complete after 0s [id=2560015702]
module.inference.module.lambda_function_container_image.aws_iam_policy.additional_inline[0]: Refreshing state... [id=arn:aws:iam::446872271111:policy/levio-demo-fev-inference-dev-role-inline]
module.ingestion.module.lambda_function_container_image.aws_iam_policy.additional_inline[0]: Refreshing state... [id=arn:aws:iam::446872271111:policy/levio-demo-fev-ingestion-dev-role-inline]
module.inference.module.lambda_function_container_image.aws_iam_role_policy_attachment.additional_inline[0]: Refreshing state... [id=levio-demo-fev-inference-dev-role-2024012615222187350000000e]
module.list_collections.module.lambda_function_container_image.aws_iam_role_policy_attachment.additional_inline[0]: Refreshing state... [id=levio-demo-fev-list-collections-dev-role-20240202005532784400000004]
module.ingestion.module.lambda_function_container_image.aws_iam_role_policy_attachment.additional_inline[0]: Refreshing state... [id=levio-demo-fev-ingestion-dev-role-2024012615222186470000000d]
module.inference.module.lambda_function_container_image.aws_lambda_function.this[0]: Refreshing state... [id=levio-demo-fev-inference-dev]
module.ingestion.module.lambda_function_container_image.aws_lambda_function.this[0]: Refreshing state... [id=levio-demo-fev-ingestion-dev]
module.list_collections.module.lambda_function_container_image.aws_lambda_function.this[0]: Refreshing state... [id=levio-demo-fev-list-collections-dev]
module.inference.module.integration_base.aws_api_gateway_integration.api_gateway_integration: Refreshing state... [id=agi-d09uj3e9kh-nw7wpk-GET]
module.ingestion.aws_lambda_event_source_mapping.event_source_mapping: Refreshing state... [id=ffdd3b10-6ac6-4fbf-bbd1-a7e6e82bf9d1]
module.list_collections.module.integration_base.aws_api_gateway_integration.api_gateway_integration: Refreshing state... [id=agi-d09uj3e9kh-4z02sq-GET]
aws_api_gateway_deployment.this: Refreshing state... [id=iamrsp]
module.ingestion.aws_s3_bucket_notification.bucket_notification: Refreshing state... [id=levio-demo-fev-storage-dev]
aws_api_gateway_stage.this: Refreshing state... [id=ags-d09uj3e9kh-dev]
aws_api_gateway_usage_plan.this: Refreshing state... [id=jxe0z0]
module.email_request_processor.module.lambda_function_container_image.aws_lambda_function.this[0]: Refreshing state... [id=levio-demo-fev-email-request-processor-dev]
aws_api_gateway_usage_plan_key.this: Refreshing state... [id=mwfvag0h0f]
module.email_request_processor.module.lambda_function_container_image.aws_lambda_event_source_mapping.this["sqs"]: Refreshing state... [id=f9630eab-ef3d-41c7-bd22-d541cb86d9a8]
module.email_request_processor.module.lambda_function_container_image.aws_lambda_permission.unqualified_alias_triggers["sqs"]: Refreshing state... [id=sqs]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
+/- create replacement and then destroy

Terraform will perform the following actions:

  # aws_api_gateway_deployment.this must be replaced
+/- resource "aws_api_gateway_deployment" "this" {
      ~ created_date  = "2024-02-22T13:57:46Z" -> (known after apply)
      ~ description   = "Deployment for 2024-02-22T13:57:46Z" -> (known after apply)
      ~ execution_arn = "arn:aws:execute-api:us-east-1:446872271111:d09uj3e9kh/" -> (known after apply)
      ~ id            = "iamrsp" -> (known after apply)
      ~ invoke_url    = "https://d09uj3e9kh.execute-api.us-east-1.amazonaws.com/" -> (known after apply)
      ~ triggers      = { # forces replacement
          - "redeployment" = "2024-02-22T13:57:46Z"
        } -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # aws_api_gateway_stage.this will be updated in-place
  ~ resource "aws_api_gateway_stage" "this" {
      ~ deployment_id         = "iamrsp" -> (known after apply)
        id                    = "ags-d09uj3e9kh-dev"
        tags                  = {}
        # (9 unchanged attributes hidden)
    }

  # module.email_request_processor.module.lambda_function_container_image.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "levio-demo-fev-email-request-processor-dev"
      ~ image_uri                      = "446872271111.dkr.ecr.us-east-1.amazonaws.com/email_request_processor@sha256:1d91fbedf1c7c01d752e6d079fc4ebc385b84515348c6d49bf1576c13ebb22be" -> "446872271111.dkr.ecr.us-east-1.amazonaws.com/email_request_processor@sha256:72c79ebd107003d13330305834c99af64c9c0c1c9f6cfc009942eccca414eeb3"
      ~ last_modified                  = "2024-02-22T13:57:47.000+0000" -> (known after apply)
        tags                           = {}
        # (18 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              - "API_KEY"   = (sensitive value)
              - "API_URL"   = "https://d09uj3e9kh.execute-api.us-east-1.amazonaws.com//dev/inference"
              - "QUEUE_URL" = "https://sqs.us-east-1.amazonaws.com/446872271111/levio-demo-fev-email-response-processor-queue-dev.fifo"
            } -> (known after apply)
        }

        # (3 unchanged blocks hidden)
    }

  # module.email_response_processor.module.lambda_function_container_image.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "levio-demo-fev-email-response-processor-dev"
      ~ image_uri                      = "446872271111.dkr.ecr.us-east-1.amazonaws.com/email_response_processor@sha256:0038d87f4dbc9c4d3ca38ec580c86e5d71cbefb75133e6e21ca5862b66aceba9" -> "446872271111.dkr.ecr.us-east-1.amazonaws.com/email_response_processor@sha256:968390020a59764b47878f01137fed22704c90170347abb9e1c6009fff76ef35"
      ~ last_modified                  = "2024-02-25T15:45:37.000+0000" -> (known after apply)
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.inference.module.integration_cognito.aws_api_gateway_integration.api_gateway_integration will be created
  + resource "aws_api_gateway_integration" "api_gateway_integration" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "GET"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = "uvd5hn"
      + rest_api_id             = "d09uj3e9kh"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:446872271111:function:levio-demo-fev-inference-dev/invocations"
    }

  # module.inference.module.integration_cognito.aws_api_gateway_method.api_gateway_method will be created
  + resource "aws_api_gateway_method" "api_gateway_method" {
      + api_key_required = false
      + authorization    = "COGNITO_USER_POOLS"
      + authorizer_id    = "p9hrwu"
      + http_method      = "GET"
      + id               = (known after apply)
      + resource_id      = "uvd5hn"
      + rest_api_id      = "d09uj3e9kh"
    }

  # module.inference.module.integration_cognito.aws_lambda_permission.lambda_permission will be created
  + resource "aws_lambda_permission" "lambda_permission" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "levio-demo-fev-inference-dev"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + source_arn          = "arn:aws:execute-api:us-east-1:446872271111:d09uj3e9kh/*/GET/inferencecog"
      + statement_id        = "AllowExecutionFromAPIGateway-levio-demo-fev-inference-dev"
      + statement_id_prefix = (known after apply)
    }

  # module.inference.module.lambda_function_container_image.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "levio-demo-fev-inference-dev"
      ~ image_uri                      = "446872271111.dkr.ecr.us-east-1.amazonaws.com/inference@sha256:2b9fd20d17947084748a168db142a6fb12c3c053ba4023f42d3e14a421c3d004" -> "446872271111.dkr.ecr.us-east-1.amazonaws.com/inference@sha256:99b69b4d9abc9aae05ee5bbcff2ac721bc77fd808e4ffb3a00dc0559d61f9b2d"
      ~ last_modified                  = "2024-02-25T16:07:40.931+0000" -> (known after apply)
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.ingestion.module.lambda_function_container_image.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "levio-demo-fev-ingestion-dev"
      ~ image_uri                      = "446872271111.dkr.ecr.us-east-1.amazonaws.com/ingestion@sha256:53e4bdcc6068cef87475ac18cdf693de4df99671564a8e26eea98fd56b4a8b1d" -> "446872271111.dkr.ecr.us-east-1.amazonaws.com/ingestion@sha256:4c8ce856252bf181a047cc1ccfb61d3f625b7dc95b33399343d83886b7b4bd48"
      ~ last_modified                  = "2024-02-25T15:45:36.000+0000" -> (known after apply)
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.lex_router.module.lambda_function_container_image.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "levio-demo-fev-lex-router-dev"
      ~ image_uri                      = "446872271111.dkr.ecr.us-east-1.amazonaws.com/lex_router@sha256:e9b4eb21a5de64dff1ce01213e8ca0a3c9128623809584a2fdd4ebba5ec32a0e" -> "446872271111.dkr.ecr.us-east-1.amazonaws.com/lex_router@sha256:d9d57533a2d12d937816582c71ca24ad0365d96414d5a06f5c8e8c9ee239346a"
      ~ last_modified                  = "2024-02-25T15:45:37.000+0000" -> (known after apply)
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.list_collections.module.lambda_function_container_image.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "levio-demo-fev-list-collections-dev"
      ~ image_uri                      = "446872271111.dkr.ecr.us-east-1.amazonaws.com/list_collections@sha256:72dd7a5f74c18dfe336d82ce2a3f43bd6fa46c1d44d63030071fefa3c11f35f2" -> "446872271111.dkr.ecr.us-east-1.amazonaws.com/list_collections@sha256:56821913263de4968d117c5131e20b93fab78e67c1338c7d7a8c59a5f0692228"
      ~ last_modified                  = "2024-02-25T16:07:40.935+0000" -> (known after apply)
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.memory.module.lambda_function_container_image.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "levio-demo-fev-memory-dev"
      ~ image_uri                      = "446872271111.dkr.ecr.us-east-1.amazonaws.com/conversation_memory@sha256:b8f936172496db392cce1c22d7253d06e7909e160ff12d63507482e24db283f6" -> "446872271111.dkr.ecr.us-east-1.amazonaws.com/conversation_memory@sha256:4bbc2f4abb25a4eb21c43b8dc232db428c1fe9419cf3cd31dd07bf448dc7780e"
      ~ last_modified                  = "2024-02-25T15:45:37.000+0000" -> (known after apply)
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

Plan: 4 to add, 8 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: terraform.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "terraform.tfplan"

```

</details>

*Pusher: @FloRul, Action: `pull_request`, Workflow: `Deploy Lambdas & Terraform Plan on PR`*